{
    "name": "Win10 - Security - Disable Always install with elevated privileges",
    "description": "HardenMDE - Disable Always install with elevated privileges v1.0",
    "platforms": "windows10",
    "technologies": "mdm",
    "settings": [
        {
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_detectapplicationinstallationsandpromptforelevation",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_detectapplicationinstallationsandpromptforelevation_0",
                    "children": []
                }
            }
        }
    ]
}