{
    "@odata.type": "#microsoft.graph.windowsHealthMonitoringConfiguration",
    "id": "45e8e12f-0c32-4414-bbd9-993249ca285f",
    "lastModifiedDateTime": "2022-09-22T12:22:52.3049586Z",
    "roleScopeTagIds": [
        "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2022-09-22T12:08:55.0173246Z",
    "description": "",
    "displayName": "Win10 - System - Intune health monitor",
    "version": 2,
    "allowDeviceHealthMonitoring": "enabled",
    "configDeviceHealthMonitoringScope": "bootPerformance,windowsUpdates",
    "configDeviceHealthMonitoringCustomScope": null
}