{
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "bb96317e-db8c-4bfe-8610-528c53c9bb34",
    "lastModifiedDateTime": "2022-09-22T14:50:47.775306Z",
    "roleScopeTagIds": [
        "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2022-09-22T12:08:55.5785574Z",
    "description": "Harden365 - Windows Update v1.0",
    "displayName": "Windows Update",
    "version": 3,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "autoInstallAtMaintenanceTime",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "qualityUpdatesDeferralPeriodInDays": 0,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "businessReadyOnly",
    "skipChecksBeforeRestart": false,
    "updateWeeks": null,
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 10,
    "qualityUpdatesWillBeRolledBack": false,
    "featureUpdatesWillBeRolledBack": false,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": null,
    "deadlineForQualityUpdatesInDays": null,
    "deadlineGracePeriodInDays": null,
    "postponeRebootUntilAfterDeadline": null,
    "autoRestartNotificationDismissal": "user",
    "scheduleRestartWarningInHours": 4,
    "scheduleImminentRestartWarningInMinutes": 60,
    "userPauseAccess": "disabled",
    "userWindowsUpdateScanAccess": "enabled",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": true,
    "installationSchedule": {
        "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
        "activeHoursStart": "08:00:00.0000000",
        "activeHoursEnd": "18:00:00.0000000"
    }
}