{
    "displayName": "Win10 - Credential Guard",
    "description": "",
    "roleScopeTagIds": [
        "0"
    ],
    "TemplateDisplayName": "Account protection (Preview)",
    "TemplateId": "0f2b5d70-d4e9-4156-8c16-1397eb6c54a5",
    "versionInfo": "2005",
    "settingsDelta": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "ee6a041c-275b-4be1-833e-92a17ad13c55",
            "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_windowsHelloForBusinessBlocked",
            "valueJson": "null",
            "value": null
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
            "id": "d5eb999e-cb57-455a-b8c7-9e2776d36698",
            "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_pinMinimumLength",
            "valueJson": "null",
            "value": null
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
            "id": "295310e8-258c-4010-971b-8d01e07591b3",
            "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_pinMaximumLength",
            "valueJson": "null",
            "value": null
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "64d76797-57dc-4039-8ce1-98a9779de93c",
            "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_pinLowercaseCharactersUsage",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "1f58679e-13bd-4442-9b83-429ed02b7b38",
            "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_pinUppercaseCharactersUsage",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "6b693935-76de-4eb4-b8dc-708d5bad3fa8",
            "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_pinSpecialCharactersUsage",
            "valueJson": "\"notConfigured\"",
            "value": "notConfigured"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
            "id": "bdb55590-531a-4953-9b34-4b34a434089e",
            "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_pinExpirationInDays",
            "valueJson": "null",
            "value": null
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementIntegerSettingInstance",
            "id": "e070c8e1-3d30-4901-b1c6-17deca0ddf00",
            "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_pinPreviousBlockCount",
            "valueJson": "null",
            "value": null
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "1970c3e2-036d-489b-b541-5436d54ebdfd",
            "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_pinRecoveryEnabled",
            "valueJson": "false",
            "value": false
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "30254196-005c-4615-9c3f-ca70f03f2711",
            "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_securityDeviceRequired",
            "valueJson": "false",
            "value": false
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "4d7834ef-5665-4bec-9511-f48058278a4d",
            "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_unlockWithBiometricsEnabled",
            "valueJson": "false",
            "value": false
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "407b87c6-6018-4dae-9953-340ff3be34c6",
            "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_enhancedAntiSpoofingForFacialFeaturesEnabled",
            "valueJson": "false",
            "value": false
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "db3ad3a2-bac7-40c3-b58e-4d57d98f74af",
            "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_useCertificatesForOnPremisesAuthEnabled",
            "valueJson": "false",
            "value": false
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "id": "c1631672-6806-484a-ae67-2e19025c8b16",
            "definitionId": "deviceConfiguration--windowsIdentityProtectionConfiguration_useSecurityKeyForSignin",
            "valueJson": "true",
            "value": true
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "id": "5a79d88e-a748-4cd4-ae04-7ba91a87b6ac",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_deviceGuardLocalSystemAuthorityCredentialGuardSettings",
            "valueJson": "\"enableWithoutUEFILock\"",
            "value": "enableWithoutUEFILock"
        }
    ]
}